In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./Final Data/deaths.csv')
df.head()

   Year          State  Alzheimer's   Heart  Cancer  Stroke  Respiratory
0  2017  United States       121404  647457  599108  146383       160201
1  2017        Alabama         2563   13110   10410    2931         3484
2  2017         Alaska           98     814     926     190          204
3  2017        Arizona         3058   12398   12008    2681         3802
4  2017       Arkansas         1436    8270    6517    1612         2517

In [4]:
df.drop("Year", axis=1, inplace=True)

In [7]:
df.drop(0, axis=0, inplace=True)
df.reset_index(drop=True, inplace=True)

In [8]:
df.head()

        State  Alzheimer's  Heart  Cancer  Stroke  Respiratory
0     Alabama         2563  13110   10410    2931         3484
1      Alaska           98    814     926     190          204
2     Arizona         3058  12398   12008    2681         3802
3    Arkansas         1436   8270    6517    1612         2517
4  California        16238  62797   59516   16355        13881

In [9]:
df.dtypes

State          object
Alzheimer's     int64
Heart           int64
Cancer          int64
Stroke          int64
Respiratory     int64
dtype: object

In [10]:
aqi = pd.read_csv('./Final Data/airquality.csv')
aqi.head()

        State  Median AQI
0     Alabama   38.277778
1      Alaska   22.000000
2     Arizona   47.230769
3    Arkansas   37.090909
4  California   49.018868

In [11]:
aqi.dtypes

State          object
Median AQI    float64
dtype: object

In [12]:
hosp = pd.read_csv('./Final Data/hospitalcounts.csv')
hosp.head()

        State  Hospitals
0      Alaska         10
1     Alabama         90
2    Arkansas         52
3     Arizona         78
4  California        340

In [13]:
ins = pd.read_csv('./Final Data/insurancecompanies.csv')
ins.head()

        State Finance and insurance Firms
0     Alabama                       3,099
1      Alaska                         415
2     Arizona                       5,248
3    Arkansas                       2,472
4  California                      29,047

In [14]:
ins['Finance and insurance Firms'] = ins['Finance and insurance Firms'].str.replace(',','')
ins.head()

        State Finance and insurance Firms
0     Alabama                        3099
1      Alaska                         415
2     Arizona                        5248
3    Arkansas                        2472
4  California                       29047

In [16]:
ins['Finance and insurance Firms'] = pd.to_numeric(ins['Finance and insurance Firms'])
ins.dtypes

State                          object
Finance and insurance Firms     int64
dtype: object

In [17]:
unemp = pd.read_csv('./Final Data/unemployment.csv')
unemp.head()

           State  rate
0         Hawaii   2.2
1       Colorado   2.6
2   North Dakota   2.6
3  New Hampshire   2.8
4       Nebraska   3.0

In [18]:
unemp.dtypes

State     object
rate     float64
dtype: object

In [19]:
unins = pd.read_csv('./Final Data/UninsuredCount.csv')
unins.head()

           State  Uninsured
0  United States      28019
1        Alabama        449
2         Alaska         98
3        Arizona        695
4       Arkansas        232

In [21]:
unins.drop(0, axis=0, inplace=True)
unins.reset_index(drop=True, inplace=True)
unins.head()

        State  Uninsured
0     Alabama        449
1      Alaska         98
2     Arizona        695
3    Arkansas        232
4  California       2797

In [22]:
unins.dtypes

State        object
Uninsured     int64
dtype: object

In [24]:
m = pd.merge(df, aqi, how='left', on='State')
m = pd.merge(m, hosp, how='left', on='State')
m = pd.merge(m, ins, how='left', on='State')
m = pd.merge(m, unemp, how='left', on='State')
m = pd.merge(m, unins, how='left', on='State')

m.head()

,State,Alzheimer's,Heart,Cancer,Stroke,Respiratory,Median AQI,Hospitals,Finance and insurance Firms,rate,Uninsured
0,Alabama,2563,13110,10410,2931,3484,38.277778,90,3099,4.5,449
1,Alaska,98,814,926,190,204,22.000000,10,415,6.5,98
2,Arizona,3058,12398,12008,2681,3802,47.230769,78,5248,5.0,695
3,Arkansas,1436,8270,6517,1612,2517,37.090909,52,2472,3.7,232
4,California,16238,62797,59516,16355,13881,49.018868,340,29047,4.8,2797

In [27]:
m.to_csv("allMerged.csv", index=False)